; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v6 ?v1)
             (pred_3 ?v3 ?v10)
             (pred_12 ?v6 ?v10)
             (pred_2 ?v5 ?v6 )
	     (pred_11 ?v6)
             (pred_8 ?v11)
             (pred_10 ?v3)
             (pred_5 ?v10)
             (pred_1 ?v6)
             (pred_9 ?v3)
             (pred_4 ?v6)
             (pred_6 ))



(:action op_1
:parameters (?v8 ?v4 ?v7 ?v2)
:precondition (and (pred_8 ?v8) (pred_8 ?v4) (pred_10 ?v7) (pred_5 ?v2)
          (pred_7 ?v8 ?v4) (pred_3 ?v7 ?v2)
                   (pred_12 ?v4 ?v2) (pred_11 ?v8) 
                   (pred_1 ?v4) (pred_9 ?v7))
:effect (and  (pred_4 ?v4) (not (pred_1 ?v4))))


(:action op_2
:parameters (?v8 ?v12)
:precondition (and (pred_8 ?v8) (pred_8 ?v12)
               (pred_11 ?v8) (pred_7 ?v8 ?v12) (pred_4 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v8))))

(:action op_4
:parameters (?v8 ?v7)
:precondition (and (pred_8 ?v8) (pred_10 ?v7) 
                  (pred_11 ?v8) (pred_2 ?v7 ?v8) (pred_6 ))
:effect (and (pred_9 ?v7)
   (not (pred_2 ?v7 ?v8)) (not (pred_6 ))))


(:action op_5
:parameters (?v8 ?v9 ?v13)
:precondition (and (pred_8 ?v8) (pred_10 ?v9) (pred_10 ?v13)
                  (pred_11 ?v8) (pred_9 ?v13) (pred_2 ?v9 ?v8))
:effect (and (pred_9 ?v9) (pred_2 ?v13 ?v8)
        (not (pred_9 ?v13)) (not (pred_2 ?v9 ?v8))))

(:action op_3
:parameters (?v8 ?v7)
:precondition (and (pred_8 ?v8) (pred_10 ?v7) 
                  (pred_11 ?v8) (pred_9 ?v7))
:effect (and (pred_6 ) (pred_2 ?v7 ?v8) (not (pred_9 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_18 obj_04 obj_03 obj_14 obj_06 obj_01 obj_07 obj_08 obj_15 obj_19 obj_17 obj_20 obj_10 obj_09 obj_16
    obj_12 obj_05
    obj_13 obj_02 obj_21
    )

    (:init
       (pred_6)

       (pred_8 obj_11)
       (pred_8 obj_18)
       (pred_8 obj_04)
       (pred_8 obj_03)
       (pred_8 obj_14)
       (pred_8 obj_06)
       (pred_8 obj_01)
       (pred_8 obj_07)
       (pred_8 obj_08)
       (pred_8 obj_15)
       (pred_8 obj_19)
       (pred_8 obj_17)
       (pred_8 obj_20)
       (pred_8 obj_10)
       (pred_8 obj_09)
       (pred_8 obj_16)
       (pred_5 obj_12)
       (pred_5 obj_05)
       (pred_10 obj_13)
       (pred_10 obj_02)
       (pred_10 obj_21)

       (pred_7 obj_11 obj_14)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_18 obj_06)
       (pred_7 obj_18 obj_04)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_18)
       (pred_7 obj_03 obj_07)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_06 obj_15)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_06 obj_18)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_07 obj_03)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_08 obj_15)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_15 obj_06)
       (pred_7 obj_15 obj_08)
       (pred_7 obj_19 obj_09)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_19 obj_15)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_10 obj_09)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_09 obj_16)
       (pred_7 obj_09 obj_19)
       (pred_7 obj_09 obj_10)
       (pred_7 obj_16 obj_17)
       (pred_7 obj_16 obj_09)
       (pred_1 obj_08)
       (pred_1 obj_20)
       (pred_1 obj_14)
       (pred_12  obj_08 obj_12)
       (pred_12  obj_20 obj_05)
       (pred_12  obj_14 obj_05)
       (pred_4 obj_11)
       (pred_4 obj_18)
       (pred_4 obj_04)
       (pred_4 obj_03)
       (pred_4 obj_06)
       (pred_4 obj_01)
       (pred_4 obj_07)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_4 obj_17)
       (pred_4 obj_10)
       (pred_4 obj_09)
       (pred_4 obj_16)

       (pred_3  obj_13 obj_12)
       (pred_3  obj_02 obj_05)
       (pred_3  obj_21 obj_12)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_21 obj_09)
       (pred_11 obj_17)
    )

    (:goal (and
       (pred_2 obj_21 obj_06)
    ))
(:constraints
  (always (not (pred_11 obj_19)))
)
)

; plan
1. (op_2 obj_17 obj_16)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_16)
   goals met: 0 of 1
2. (op_2 obj_16 obj_09)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_09)
   goals met: 0 of 1
3. (op_4 obj_09 obj_21)
   deleted: (pred_2 obj_21 obj_09) (pred_6)
   added: (pred_9 obj_21)
   goals met: 0 of 1
4. (op_2 obj_09 obj_10)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_10)
   goals met: 0 of 1
5. (op_2 obj_10 obj_15)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_15)
   goals met: 0 of 1
6. (op_2 obj_15 obj_06)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_06)
   goals met: 0 of 1
7. (op_3 obj_06 obj_21)
   deleted: (pred_9 obj_21)
   added: (pred_6) (pred_2 obj_21 obj_06)
   goals met: 1 of 1
